/*
Navicat MySQL Data Transfer

Source Server         : 线上_new
Source Server Version : 50722
Source Host           : localhost:3306
Source Database       : notebook

Target Server Type    : MYSQL
Target Server Version : 50722
File Encoding         : 65001

Date: 2018-08-17 14:40:01
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `sys_note_book`
-- ----------------------------
DROP TABLE IF EXISTS `sys_note_book`;
CREATE TABLE `sys_note_book` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `title` varchar(255) DEFAULT NULL COMMENT '标题',
  `content` varchar(2000) DEFAULT NULL COMMENT '内容',
  `release_date` datetime DEFAULT NULL COMMENT '发布日期',
  `author` varchar(20) DEFAULT NULL COMMENT '作者',
  `status` varchar(20) DEFAULT NULL COMMENT '状态',
  `level` varchar(20) DEFAULT NULL COMMENT '优先级',
  `type` varchar(20) DEFAULT NULL COMMENT '问题类型',
  `dr` tinyint(4) DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=149 DEFAULT CHARSET=utf8 COMMENT='记事本';

-- ----------------------------
-- Records of sys_note_book
-- ----------------------------
INSERT INTO `sys_note_book` VALUES ('2', '员工群要能踢人', '员工群要能踢人,详细需要进一步讨论\n换成腾讯IM后直接按此方案作', '2018-04-02 12:31:44', '高威', '已解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('3', '购买健身卡手机号不显示', '购买健身卡手机号不显示', '2018-04-02 12:32:46', '高威', '已解决', '低', '开发问题', '0');
INSERT INTO `sys_note_book` VALUES ('4', '人员身份变更  app端更新菜单的问题', '解决方案：给人员设置一个标志标量，表示是否变更或新添加了身份，app打开门店页面请求一下，如果变更就重新拉一下数据，并把这个标志位恢复。\n已解决,用推送', '2018-04-02 13:48:02', '孙宏宇', '已解决', '低', '设计问题', '0');
INSERT INTO `sys_note_book` VALUES ('5', '卡升级第二步会需要选择付款方式', '卡升级第二步会需要选择付款方式', '2018-04-02 14:57:31', '李佳楠', '已解决', '低', '开发问题', '0');
INSERT INTO `sys_note_book` VALUES ('6', '停卡功能', '加字段停卡事由,批准人;没有任何逻辑约束', '2018-04-02 15:36:13', '高威', '已解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('7', '卡种维护', '加说明字段无逻辑约束', '2018-04-02 15:36:53', '高威', '已解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('8', 'PC端登陆绑定电脑', '建议下载证书的方式，店长有权下载证书给员工的个人帐号使用', '2018-04-02 20:01:45', '高威', '已解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('9', '开发和生产环境，环信id注册冲突问题', '开发和生产环境，环信id注册冲突问题，导致注册失败，需要解决', '2018-04-03 10:29:54', '孙宏宇', '已解决', '高', '设计问题', '0');
INSERT INTO `sys_note_book` VALUES ('10', 'aap端，退出和切换门店设计逻辑冲突', 'app端现有设计，用户如果已经加入一家门店，如果不退出当前店是无法查看其它门店并加入的，与切换门店有冲突。', '2018-04-03 10:44:41', '孙宏宇', '已解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('11', '建议用统一使用字典来翻译编码与中文显示', '可以利用字典生成前端的过滤器,减少多处维护字典值与参数引起不一至,同时可取消现在有常量类', '2018-04-03 11:37:42', '高振中', '延期解决', '低', '设计问题', '0');
INSERT INTO `sys_note_book` VALUES ('12', '会员刷卡入场相关需求问题', '会员刷卡入场成功后，只给会员的会籍顾问推送消息，没有给会员推送消息', '2018-04-03 17:41:57', '孙宏宇', '已解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('13', 'app端各种协议的入口，目前原型图里没有', 'app端各种协议的入口，目前原型图里没有，注册协议，买卡协议，私教协议', '2018-04-04 09:50:29', '孙宏宇', '已解决', '低', '设计问题', '0');
INSERT INTO `sys_note_book` VALUES ('14', '创建员工时自动创建潜客身份', '创建员工时自动检测是不是潜客，否则自动创建潜客生成潜客员工双身份，如果之前是会员，则创建会员和员工双身份。', '2018-04-04 11:28:00', '高威', '已解决', '中', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('15', '接口无数据时的显示画面', '接口无数据时，图片显示问题，种类包括（卡，私教，门店图），目前如果没有数据，显示的是空白，影响美观', '2018-04-04 15:57:17', '张震峰', '已解决', '低', '设计问题', '0');
INSERT INTO `sys_note_book` VALUES ('16', 'PC前端登陆及返回首页，打开页面卡。', 'PC前端登陆及返回首页，打开页面卡。', '2018-04-08 09:26:10', '高威', '已解决', '高', '开发问题', '0');
INSERT INTO `sys_note_book` VALUES ('17', '支付宝开发者平台申请问题', '申请未完成', '2018-04-08 09:31:55', '高威', '已解决', '高', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('18', '微信开放者平台申请问题', '开放平台申请未能过。\n', '2018-04-08 09:35:16', '高威', '已解决', '高', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('19', 'pc端打开有左导航的首次点开默认第一项左边导航也需要变蓝色', '如打开潜客管理-潜客工作，左导航未提示变色', '2018-04-08 10:46:20', '范国利', '已解决', '中', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('20', '电脑pc端刷卡入场-次数能不能显示出来，下方需要显示当天进场记录', null, '2018-04-08 10:50:05', '范国利', '延期解决', '中', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('21', '搜索会员身份三框合一（编号/姓名/手机号）以后要改成一个搜索框', null, '2018-04-08 10:51:50', '范国利', '已解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('22', 'pc所有的业务都要有业务操作人并显示', null, '2018-04-08 11:05:21', '范国利', '延期解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('23', '原型图编辑个人资料里 没有编辑身高体重的入口', '原型图编辑个人资料里 没有编辑身高体重的入口', '2018-04-09 09:41:50', '孙宏宇', '已解决', '低', '设计问题', '0');
INSERT INTO `sys_note_book` VALUES ('24', '我的页面 原来有一个我的消息 里面是点赞和评论等消息通知，现在这个版本没有入口了', '我的页面，原来有一个我的消息，里面是点赞和评论等消息通知，现在这个版本没有入口了', '2018-04-09 09:43:30', '孙宏宇', '已解决', '低', '设计问题', '0');
INSERT INTO `sys_note_book` VALUES ('25', '工作人员-新增资质认证保存添加一个认证之后添加第二个认证显示成功，但是下方列表不显示', null, '2018-04-09 15:09:09', '范国利', '已解决', '高', '开发问题', '0');
INSERT INTO `sys_note_book` VALUES ('26', '购卡记录中为何会有，无卡号的会员卡记录。', '购卡记录中为何会有，无卡号的会员卡记录。\n\n\n不需要解决：未发卡的记录', '2018-04-11 16:30:32', '高威', '已解决', '高', '开发问题', '0');
INSERT INTO `sys_note_book` VALUES ('27', '定金购买输入金额问题', '购买定金价格让人看不懂，这是花钱，固定定金区间', '2018-04-12 13:14:34', '唐植超', '已解决', '高', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('28', '后台 系统 --操作记录', 'admin 用户\n市场部负责人\n市场部经理\n\n所有操作都要操作记录', '2018-04-12 13:16:49', '唐植超', '延期解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('29', '加盟商改加盟方', '因为加盟商可能是人也可能是一个公司', '2018-04-12 13:17:53', '唐植超', '延期解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('30', '后台系统门店增加', '门店增加授权期限，管理费，加纳管理费时间', '2018-04-12 13:18:52', '唐植超', '延期解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('31', '手机端：举报功能最好能放在动态列表页面，', '考虑到ios申请app 的问题', '2018-04-12 13:20:02', '唐植超', '已解决', '高', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('32', '环信im换成腾讯', '待讨论', '2018-04-12 13:21:44', '唐植超', '已解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('33', '手机端无法加入其它门店', '已经加入门店的，无法加入其它门店', '2018-04-12 15:07:51', '唐植超', '已解决', '高', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('34', '购卡购买定金页面', '购卡购买定金页面里会员须知的内容', '2018-04-12 16:15:27', '孙宏宇', '已解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('35', '卡，课，柜 的会员须知', '卡，课，柜 的会员须知', '2018-04-12 16:16:12', '唐植超', '已解决', '高', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('36', '微信公众号，我的租柜', '我的租柜列表显示失败，', '2018-04-16 16:51:44', '唐植超', '已解决', '高', '开发问题', '0');
INSERT INTO `sys_note_book` VALUES ('37', '微信公众号，卡列表', '卡列表布局，购买按钮问题', '2018-04-16 16:52:32', '唐植超', '已解决', '高', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('38', '微信公众号，定位问题，', '每次都提示确认定位', '2018-04-16 16:53:16', '唐植超', '已解决', '高', '开发问题', '0');
INSERT INTO `sys_note_book` VALUES ('39', '微信公众号，轮播图没有title', '主要是控件还没有研究', '2018-04-16 16:54:06', '唐植超', '已解决', '高', '开发问题', '0');
INSERT INTO `sys_note_book` VALUES ('40', '6月份以后所有显示图片尺寸要统一', null, '2018-04-17 10:36:36', '范国利', '延期解决', '高', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('41', '数据要加索引', '为提高查询效率,要在查询频率高的字段加索引', '2018-04-17 16:41:52', '高振中', '延期解决', '低', '设计问题', '0');
INSERT INTO `sys_note_book` VALUES ('42', '退定金记录查询条件使用日期是否按时间段查询', '不确定是按某一确定时间查还是按时间段查询', '2018-04-17 17:02:43', '王丽萍', '延期解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('43', 'web编辑员工资料后，人员昵称变成空', 'web编辑员工资料后，人员昵称变成空', '2018-04-18 09:53:18', '孙宏宇', '已解决', '低', '开发问题', '0');
INSERT INTO `sys_note_book` VALUES ('44', '退卡的钱的去向的问题', '退卡的钱的去向的问题', '2018-04-18 14:47:35', '高振中', '已解决', '高', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('45', 'emoji表情', '阿里云服务器，用户昵称不支持emoji表情，潜客维护和会员维护相关编辑资料，是否需要兼容emoji表情', '2018-04-23 17:43:39', '孙宏宇', '已解决', '低', '开发问题', '0');
INSERT INTO `sys_note_book` VALUES ('46', 'app内工作总结菜单拆分为员工和主管', 'app内工作总结菜单拆分为员工和主管', '2018-04-24 15:32:26', '高威', '延期解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('47', 'APP端是否拆分为员工和会员两个部分', '讨论一下', '2018-04-24 15:33:01', '高威', '延期解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('48', '继卡升级不能使用定金', '可以先把定金退掉用现金支付', '2018-04-24 17:04:13', '高振中', '已解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('49', '被推荐新用户 在登录页面输入用户名密码后点登录报异常 返回码是500', '被推荐新用户 在登录页面输入用户名密码后点登录报异常 返回码是500', '2018-04-24 17:31:56', '孙宏宇', '已解决', '低', '开发问题', '0');
INSERT INTO `sys_note_book` VALUES ('50', '体测分析照片', '体测分析自定义相机图层', '2018-04-25 10:02:19', '张震峰', '延期解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('51', '私教签到', '私教签到流程', '2018-04-25 10:05:42', '张震峰', '已解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('52', 'admin新增人员时', 'admin新增人员时，如已是存在人员的手机号，要把人员信息带过来。\n\n已经存在只能修改，不能添加，', '2018-04-28 13:59:51', '高威', '已解决', '中', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('53', '证件号码验证重复', '如果出现重复怎么处理', '2018-04-28 14:23:55', '高威', '已解决', '高', '设计问题', '0');
INSERT INTO `sys_note_book` VALUES ('54', '同一手机号码在不同时间段被不同人使用', '验证份证。', '2018-04-28 14:24:53', '高威', '已解决', '高', '设计问题', '0');
INSERT INTO `sys_note_book` VALUES ('55', 'PC端加使用反馈', null, '2018-04-28 14:31:18', '高威', '已解决', '高', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('56', '客户来源中增加其它', ' 其它来源在店内细分合商来源初步设计为在人员表加小来源字段', '2018-04-28 16:59:41', '高振中', '延期解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('57', '添加课程时要能多选', '一次选多个星期', '2018-04-28 17:25:33', '高振中', '延期解决', '中', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('58', '给所有产品订单增加两个字段，查询时候不用再翻译', 'product_type 产品类型名称 product_name产品名称', '2018-05-02 17:12:57', '孙宏宇', '已解决', '低', '开发问题', '0');
INSERT INTO `sys_note_book` VALUES ('59', '数据权限问题', '阿里云上出现：\n购卡成功，会员没有终生会籍\n普通员工登录，能够查询到别人的信息', '2018-05-03 14:37:50', '唐植超', '已解决', '高', '开发问题', '0');
INSERT INTO `sys_note_book` VALUES ('60', '数据权限问题', '卡，卡记录\n租柜，租柜记录\n私教，私教记录\n团教，团教记录\n都没有根据会籍或教练进行数据权限过滤\n\n前台是否有查看所有业务数据的权限', '2018-05-04 13:46:01', '唐植超', '已解决', '高', '开发问题', '0');
INSERT INTO `sys_note_book` VALUES ('61', '数据排序问题', '会员，潜客，购卡，等，所有数据库都是顺排序，刚刚添加的用户，显示在最后一页\n已修改 卡 课 柜 定单 储值 定金相关 员 工潜客 会员 排序 ', '2018-05-04 13:47:00', '唐植超', '已解决', '高', '开发问题', '0');
INSERT INTO `sys_note_book` VALUES ('62', '数据权限希望细化', '可以设置是否可以查看他人的数据，是否可以导出，是否可以跨部门等', '2018-05-05 11:17:55', '唐植超', '延期解决', '中', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('63', '发布的时候，不要停掉记事本项目', '记得了', '2018-05-05 14:24:38', '唐植超', '已解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('64', 'IOS,App,门店轮播图,点击后,跳转网页适配问题,无法返回', 'App,门店轮播图,点击后,跳转网页适配问题,无法返回', '2018-05-05 14:31:21', '高威', '已解决', '高', '开发问题', '0');
INSERT INTO `sys_note_book` VALUES ('65', 'IOS手机端关注门店后,PC端无数据', '请提供更详细的描述', '2018-05-05 14:38:55', '高威', '已解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('66', 'PC端无法添加卡协议,里面无数据', null, '2018-05-05 14:43:06', '高威', '已解决', '高', '开发问题', '0');
INSERT INTO `sys_note_book` VALUES ('67', '门店的默认图片，课程什么的，图片，没有管理', '后端已有接口', '2018-05-07 15:46:57', '唐植超', '未解决', '高', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('68', '添加员工时输入身份证，成为会员还要输入证件号', null, '2018-05-08 14:43:57', '唐植超', '已解决', '低', '开发问题', '0');
INSERT INTO `sys_note_book` VALUES ('69', '买卡没有前科信息', '已解决,等发版', '2018-05-08 15:28:57', '唐植超', '已解决', '高', '开发问题', '0');
INSERT INTO `sys_note_book` VALUES ('70', '新增会员提示手机号存在描述有问题', null, '2018-05-08 15:29:49', '唐植超', '已解决', '高', '开发问题', '0');
INSERT INTO `sys_note_book` VALUES ('71', '会籍或教练数据权限', '如果当前会员是教练或会籍 只能选自己', '2018-05-08 15:33:11', '唐植超', '已解决', '高', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('72', '岗位类型删除操教', '已解决,线上字典数据已删除', '2018-05-08 15:33:37', '唐植超', '已解决', '高', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('73', '潜客查询时', '选择一个不可能查询出数据的用户，结果数据应该是没有\n\n已解决待发版', '2018-05-08 15:40:51', '唐植超', '已解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('74', '相同的图标需要换掉', null, '2018-05-08 15:43:15', '唐植超', '已解决', '高', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('75', '销售统计数据不正确，非店长', '还有app 应该放一起', '2018-05-08 15:44:49', '唐植超', '已解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('76', '普通人员没有跳到收银界面', null, '2018-05-08 15:46:27', '唐植超', '已解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('77', '购买健身卡，购卡金额没有', '已解决等待发版', '2018-05-08 15:48:16', '唐植超', '已解决', '高', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('78', '确认入场记录是否记录人', '记了会员编号没有记会员ID 结论是可以统记人的入场次数', '2018-05-08 15:57:08', '唐植超', '已解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('79', 'admin 端没有数据权限', '没有指定他的门店的时候，他能查询到某个门店', '2018-05-09 09:21:02', '唐植超', '已解决', '低', '开发问题', '0');
INSERT INTO `sys_note_book` VALUES ('80', '性别只留男女，去掉其他两个', '已解决待发版', '2018-05-09 09:30:14', '唐植超', '已解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('81', 'web 端所有的记录相关的列表，都是进入页面刷新', null, '2018-05-09 11:56:09', '唐植超', '未解决', '高', '开发问题', '0');
INSERT INTO `sys_note_book` VALUES ('82', 'PC,IOS,安卓，手机验证', '包括手机短信密码修改，手机短信验证登陆，更换绑定手机号短信验证，要考虑到将来的手机号无法使用的密码修改问题', '2018-05-09 12:03:43', '高威', '已解决', '中', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('83', '添加门店选店长', null, '2018-05-09 16:54:34', '唐植超', '延期解决', '低', '设计问题', '0');
INSERT INTO `sys_note_book` VALUES ('84', '添加加盟商需要增加许多信息', '需要增加 企业开户行等', '2018-05-09 17:02:04', '唐植超', '延期解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('85', 'PC端忘记密码功能', null, '2018-05-09 17:10:31', '唐植超', '已解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('86', '修改员工密码', '所有的员工密码都有修改口子。\n还得知道是谁修改的', '2018-05-09 17:12:02', '唐植超', '延期解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('87', '动态验证码问题', '登录界面增加一个 动态口令\n手机端员工增加一个图标，这个图片里面会有定时获取动态口令的代码\n\n服务器端及PC端已完成 app端未完成', '2018-05-09 17:36:50', '唐植超', '已解决', '高', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('88', '员工密码默认身份证后6位', 'webcenter中加员工已处理', '2018-05-09 18:04:24', '唐植超', '已解决', '高', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('89', '待办事项', '“代办事项”改“待办事项”\n已解决未发版', '2018-05-09 18:58:47', '王晓宇', '已解决', '低', '设计问题', '0');
INSERT INTO `sys_note_book` VALUES ('90', '课表的展现问题', 'http://www.stargym.com.cn/images/news/images/C_1408/yuanshen.jpg', '2018-05-10 15:51:29', '高威', '未解决', '中', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('91', 'APP,门店详情展现的课表,用图片表示,点示查看课表', '没加入门店的,点击是提醒加入门店,已加入门店的点击门店页面中的门店名称进入门店详情页', '2018-05-10 15:54:45', '高威', '未解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('92', '我的单店排名和app排名接口中排名数据有问题', '超哥改的', '2018-05-10 17:45:40', '王丽萍', '已解决', '高', '开发问题', '0');
INSERT INTO `sys_note_book` VALUES ('93', '案例云上的端口要关闭，', '只留几个需要访问的端口，其他端口都关闭', '2018-05-11 13:43:01', '唐植超', '已解决', '高', '开发问题', '0');
INSERT INTO `sys_note_book` VALUES ('94', '公众号展示全菜单，不实现的弹出下载app提示', null, '2018-05-14 10:25:45', '唐植超', '已解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('95', '敏感字匹配机制优化', '敏感字匹配机制优化', '2018-05-22 09:55:13', '李佳楠', '延期解决', '低', '开发问题', '0');
INSERT INTO `sys_note_book` VALUES ('96', '门店组织机构和岗位设计问题', '需要重新讨论组织结构，和岗位设计问题', '2018-05-23 16:08:51', '唐植超', '已解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('97', '潜客和会员管理', '潜客和会员管理页面 listview 顶部添加搜索条 ， iOS端分页展示数据一页12条数据，iOS和安卓端添加当前展示的个数', '2018-06-02 11:04:50', '杨爱鑫', '延期解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('98', '回访必须标明是潜客回访还是会员回访', null, '2018-06-04 17:45:09', '唐植超', '已解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('99', '一个人没有加入任何门店能否发评论和举报', '（手机端）', '2018-06-06 10:52:34', '唐植超', '已解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('100', '门店太少，而且不能搜索（手机端）', '（手机端）', '2018-06-06 10:53:08', '唐植超', '未解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('101', '搜索会员应该改为模糊搜索，返回的列表', null, '2018-06-06 11:51:29', '唐植超', '已解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('102', '手机端 工作总结 体验有问题', null, '2018-06-07 10:28:37', '唐植超', '延期解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('103', '团体私教预约，选择课程页面优化', '团体私教预约时，列表中显示自己是否已经报名，还可以报名的人数', '2018-06-07 11:15:54', '李佳楠', '未解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('104', '课程相关', '取消课，\n换课，\n换教练', '2018-06-07 16:29:58', '唐植超', '延期解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('105', '搜索框', '手机端：许多地方要加入搜索框，要多框合一\npc端；\n搜索 会员：手机号，会员姓名，会员昵称，会员号 合一\n搜索员工：姓名，手机号，员工号 合一', '2018-06-08 10:18:27', '唐植超', '延期解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('106', '没关注门店，首页显示离自己最近的店', null, '2018-06-11 09:21:17', '唐植超', '已解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('107', '轮播图可以放课程，卡等功能', null, '2018-06-11 09:25:12', '唐植超', '延期解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('108', '菜单顺序，分类比较乱，', null, '2018-06-11 09:28:47', '唐植超', '延期解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('109', '健身圈', '其实就是我的动态', '2018-06-11 09:43:17', '唐植超', '已解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('110', '统计用户行为', null, '2018-06-11 09:48:08', '唐植超', '延期解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('111', '全文检索', '希望许多搜索都能做全文搜索', '2018-06-11 15:14:06', '唐植超', '延期解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('112', 'app推荐，不能修改和删除，但是有推荐上限', null, '2018-06-12 15:27:28', '唐植超', '延期解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('113', '门店营业时间问题', null, '2018-06-12 17:02:23', '唐植超', '延期解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('114', 'app 验证码是否考虑用多个输入框做', null, '2018-06-12 17:57:37', '唐植超', '延期解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('115', '支付密码是否考虑一下', null, '2018-06-12 17:57:52', '唐植超', '延期解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('116', '注册时姓名是否必填', null, '2018-06-13 10:25:38', '唐植超', '已解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('117', '门店排序 （app）应该是按最近的距离排序', null, '2018-06-14 17:36:59', '唐植超', '延期解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('118', '门店定位（能不能调用高德或者百度进行导航）', null, '2018-06-14 17:37:40', '唐植超', '延期解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('119', 'PC端分两个版本，界面两个风格', 'PC端分两个版本，一高一低，界面两个风格，一个专业，一个简洁（现有的模式可以叫简洁）', '2018-06-16 09:53:27', '高威', '未解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('120', 'PC端首页显示的数据，每个人显示的数据不一样，页面格式是一样的。', null, '2018-06-16 09:54:56', '高威', '未解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('121', '第二版要做一个非动岚健身标识的系统。', null, '2018-06-16 10:04:08', '高威', '未解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('122', '上传图片都是没有删除，也没有覆盖的方式，会导致系统产生很多垃圾图片', null, '2018-06-28 15:55:55', '唐植超', '未解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('123', '建议弄一个时段卡，或者课，', '时段卡，时段课 可以只在固定时段才能入场，但是价格会比普通的便宜', '2018-07-23 11:10:38', '唐植超', '未解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('124', 'app加固是否做了', null, '2018-07-23 11:11:50', '唐植超', '未解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('125', 'app 端，token 和 票据问题', null, '2018-07-23 11:21:58', '唐植超', '未解决', '低', '设计问题', '0');
INSERT INTO `sys_note_book` VALUES ('126', '人的注册来源（app注册，员工app添加，后端添加 等）', null, '2018-07-23 11:47:16', '唐植超', '未解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('127', '姓名输入必须判断不能全是数字', null, '2018-07-26 15:44:45', '唐植超', '未解决', '高', '开发问题', '0');
INSERT INTO `sys_note_book` VALUES ('128', '门店拥有的支付类型是不一样的', '有的用户只有现在的模式，有的支持兴业银行，有的都支持', '2018-07-26 15:46:18', '唐植超', '未解决', '高', '开发问题', '0');
INSERT INTO `sys_note_book` VALUES ('129', '添加潜客和添加会员菜单中了解途径名称修改为客户来源，该选项应该与,潜客和会员回访内容一种结构', '即是可在Admin端添加内容，修改内容，WEB门店端可自行添加，修改本店，但不可修改Admin预制项', '2018-07-27 09:26:07', '高威', '未解决', '高', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('130', '业绩黑板', '业务，业绩，按天，按周，按月，占比图，波形图，会籍部，教练部，', '2018-07-28 14:37:56', '高威', '未解决', '高', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('131', '会员卡销售饼状图', '卡种销售占比', '2018-07-28 14:44:17', '高威', '未解决', '高', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('132', '会籍部按天，按月，制定任务，查看任务完成比例', '会籍部按天，按月，制定任务，查看任务完成比例，可不按 人。', '2018-07-28 14:52:16', '高威', '未解决', '中', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('133', '销售业绩饼状图，波形图，按天，按周，按月，按人，按部门，按店', '销售业绩饼状图，波形图，按天，按周，按月，按人，按部门，按店', '2018-07-28 14:54:29', '高威', '未解决', '中', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('134', '潜客来源饼状图，波形图，按天，按周，按月，按人，按部门，按店。', '潜客来源饼状图，波形图，按天，按周，按月，按人，按部门，按店。', '2018-07-28 14:55:47', '高威', '未解决', '中', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('135', '人员信息倒入', 'WEB端，人员信息导入，入口分潜客和会员，界面，格式，内容（姓名，性别，手机，证件类型，证件号，相片），倒入结果显示成功数量，未成功数量，未成功名单及未成功原因。', '2018-07-30 11:19:09', '高威', '未解决', '高', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('136', '潜客修改算不算维护？', '不算维护', '2018-07-31 09:42:21', '唐植超', '未解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('137', 'admin门店权限bug,没法追加', null, '2018-08-01 14:59:57', '唐植超', '未解决', '低', '设计问题', '0');
INSERT INTO `sys_note_book` VALUES ('138', 'admin 端的用户也要有类似member_no 的序号', null, '2018-08-01 18:15:53', '唐植超', '未解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('139', '手机端登陆可用帐号或手机号.如手机号被解绑,那应在手机端有提示.立刻绑定手机号', '手机端登陆可用帐号或手机号.否则手机号被解绑,将无法登陆,如手机号被解绑,可用帐号登陆,应在手机端有提示.立刻绑定手机号', '2018-08-02 18:04:16', '高威', '未解决', '中', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('140', '同一个会员有多张卡，是否可以同时刷卡入场', null, '2018-08-03 14:57:21', '唐植超', '已解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('141', '卡加次，是否能超过原本的总次数，', '比方说一个100次卡，能不能加查过100次', '2018-08-03 14:58:06', '唐植超', '已解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('142', '健身卡管理所有页面搜索都要有会籍搜索', null, '2018-08-10 17:47:23', '范国利', '未解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('143', '会员管理-会员工作需要添加相关订单', null, '2018-08-10 17:48:13', '范国利', '未解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('144', '工作总结要像业务报表一样分成四块（会籍部教练部服务部店长），提交人姓名改成下拉框选择', null, '2018-08-10 17:51:36', '范国利', '未解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('145', '业绩报表也分成四类（会籍教练服务店长）', null, '2018-08-10 17:52:43', '范国利', '未解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('146', '课种记月是按月算，一对一私教课种是按节和按月，团体私教是按节和按月', null, '2018-08-10 17:54:20', '范国利', '未解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('147', '字段设置-说明须知是在上线的时候需要整好点', null, '2018-08-10 17:56:10', '范国利', '未解决', '低', '需求问题', '0');
INSERT INTO `sys_note_book` VALUES ('148', '门店总览需要加个选择时间', null, '2018-08-13 15:46:28', '范国利', '未解决', '低', '需求问题', '0');

-- ----------------------------
-- Table structure for `sys_user`
-- ----------------------------
DROP TABLE IF EXISTS `sys_user`;
CREATE TABLE `sys_user` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `name` varchar(20) DEFAULT NULL COMMENT '姓名',
  `password` varchar(100) DEFAULT NULL COMMENT '密码',
  `login_id` varchar(50) DEFAULT NULL COMMENT '登录名',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=15 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of sys_user
-- ----------------------------
INSERT INTO `sys_user` VALUES ('1', '管理员', 'a1d83431229cbda302fb33f24276c446', 'admin');
INSERT INTO `sys_user` VALUES ('3', '李佳楠', '91c452e15df0db1c407ae74677b04b19', 'lijianan');
INSERT INTO `sys_user` VALUES ('4', '高振中', 'e39769c268fbafd287a4b639724631e0', 'gzz');
INSERT INTO `sys_user` VALUES ('5', '唐植超', '3a1a34d29a3da8e3b7a04a79886e4ea8', 'tzc');
INSERT INTO `sys_user` VALUES ('6', '高威', '630526ef7fdca9b932261490a074dc85', 'gw');
INSERT INTO `sys_user` VALUES ('7', '范国利', 'c248e25d875edec26be73d4761bb5491', 'fgl');
INSERT INTO `sys_user` VALUES ('8', '王丽萍', '92e918b4b0a5614ea9bed73a65379d5a', 'wlp');
INSERT INTO `sys_user` VALUES ('9', '孙宏宇', '88d4d41195f1b5b8c46d7cfb1c0bc165', 'shy');
INSERT INTO `sys_user` VALUES ('10', '张震峰', 'd1bce9fb99ece64142c76860875afac3', 'zzf');
INSERT INTO `sys_user` VALUES ('11', '杨爱鑫', '283567b9fffc4dcefab047ff231308df', 'yax');
INSERT INTO `sys_user` VALUES ('12', '张亚茹', 'bf0864baccce355a7c3d8557298e33ec', 'zyr');
INSERT INTO `sys_user` VALUES ('13', '王晓宇', '4417a0d76a70aa96fa4854bdf83718e8', 'wxy');
INSERT INTO `sys_user` VALUES ('14', '郭安龙', '1f93a3057bf37a9b2435138d3c6ad088', 'gal');
